; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph1 - mode
	spectrograph6 - mode
	thermograph4 - mode
	infrared0 - mode
	infrared2 - mode
	image3 - mode
	image5 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star8 - direction
	Star9 - direction
	GroundStation10 - direction
	Star12 - direction
	Star11 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph6)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star11)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
)
(:goal (and
	(have_image Star13 image3)
	(have_image Phenomenon14 thermograph4)
	(have_image Planet15 infrared2)
	(have_image Planet15 image3)
	(have_image Planet16 image3)
	(have_image Planet16 thermograph4)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 phenomenon14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 6
3. (turn_to satellite0 star11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star11)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star11)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 phenomenon14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 6
6. (take_image satellite0 phenomenon14 instrument0 thermograph4)
   added: (have_image phenomenon14 thermograph4)
   goals met: 1 of 6
7. (turn_to satellite0 planet15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet15)
   goals met: 1 of 6
8. (take_image satellite0 planet15 instrument0 image3)
   added: (have_image planet15 image3)
   goals met: 2 of 6
9. (take_image satellite0 planet15 instrument0 infrared2)
   added: (have_image planet15 infrared2)
   goals met: 3 of 6
10. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 3 of 6
11. (take_image satellite0 planet16 instrument0 image3)
   added: (have_image planet16 image3)
   goals met: 4 of 6
12. (take_image satellite0 planet16 instrument0 thermograph4)
   added: (have_image planet16 thermograph4)
   goals met: 5 of 6
13. (turn_to satellite0 star13 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star13)
   goals met: 5 of 6
14. (take_image satellite0 star13 instrument0 image3)
   added: (have_image star13 image3)
   goals met: 6 of 6
